import logging
import sys
import time

from pypresence import Presence
from pypresence.types import ActivityType

from config import settings

logging.basicConfig(
    level=logging.INFO,
    format='%(asctime)s - %(name)s - %(levelname)s - %(message)s',
    handlers=[logging.StreamHandler(sys.stdout)],
)

logger = logging.getLogger(__name__)


def main(loop: bool = False):
    client_id = settings.APP_ID
    RPC = Presence(client_id)

    base_params = {
        'details': 'Пинаю хуище',
        'state': '¯\_(ツ)_/¯',
        'start': int(69.0),
        'large_text': """Z̴̨̙̟̠̞̰̳͖͖̅̾̉̆̎̀̃̌̃̐̽̍̇̈́̍́̀́̈́͐́͌̚͜͠͝ͅͅŹ̴̮̣͙̍̀͆̒́͒̐̊͗̽͗̀̐̈́̏́͋́̽̆͌̒̇̓̇̈͘Ẕ̷̢̡̨̨͎̘̩̞̬̥̯̮̗̳̱̫̖̥͕̖̠̞̭͈͔͔͙̗̻̞̠̘̗̲̦̬͍̲̯̟̟̤̱̩̳̝̔̓̔̒͋̑̓́͑̽́͗͑͛̍̂̏̚͘͜͝ͅŹ̴̢̢̼̠̺̹̟̳̹͚̳̺͖̫̠̰̤͖͍̩͚̻̝̱̇̌͐́̅̈́̇̾̃̈̊̿̈́̋̽̂̋̄͑̓̃̉̓̃̓́̂͗̇͂̃͜͝͝͠Z̵̡̢̡̛̲̺̮͓͈͉̲̖͆͛͗̌͗̽͛̇͂̓̇̊̌̀͑̆̿̂̕͘͜͝͠͝ͅZ̶̧̨̢̧̨̨̢̛͚͖͙̙̣̥̘͈̩̹̝̣͍̫̜̯̳̮̹͇̺͎̬̪̥̳͇̪̲̯̠͔͓͍̹̤͇̭͉̃̅̀̓̎̊̌͋͋́̑̇̋̏͋́̾̿͛͆͒̔́̀̀̓͛͋́̈́͂̈́͂̈̾̌͐̐̕̚͜͜͝͝͝͝ͅͅZ̸̡̧͚̹̟͕̹̲̟͎̞̥̜̮̻̘͔͎͚̼̙̫̫̣̠̭̖̙̙̬̲̊̆͑̉̀͆͊̄̓̈́̈̑͋̃͂͐̊̇̔́̉̅̑̎̎̔̔̎̈́̎̅̕̕̚̚͝͝Z̶̧̭̩̱̲̗̳̦͉͍̭̣͙͑͋̀̾͊̂̊̔̉̿͋̈̒̐̾̾͛̌̏̈́̎̈͌̄̓̓̃̆̈́̕̚̚͝͝ͅZ̴̡̧̢͚̩̣̞̤̝̝͇̬̣̙̭̥̖̝̝͈̗̭͎̘̤̖̣̤̺̅̆͛͊̓̈́̃̑̒̒̍̄̃̌̽͐̍̂̀̑͑̊̈́͊̾̀̊̊̽̐͌̈́̄̍̔̉͆̈́͒̋̽̏͘̕͘͝͝ͅZ̸̡̨͍̝̝̰̺̻̊́̒̇̈̃̃̔͛̎̾̽̃̎̽͛̈͗̏͋̌̀̐͑͋́̌̓̈́̒͜͝Ź̴̨̨̧̛̩͓̟̮̮̙̟̪͙̦̖̹͕̄͆̈́̊͌̋̑̈́̉̀͌̔̓̀̇̆̋̔̋̈́͘͠Ż̴̧͍̙̭̞̙̟͖̗̯̪͍̱͕͓̭̣̗̠̦̱͍͖̬͚̟̩̻̋͂͑̓̐͒̽̋͐̄́̀͐̅̇͂̊̔́̄̄͊͒̊͒̒̿̐͂̒̈́̉̽̎̍̑̈͒͌̾͒͑͊̎̋̕̕̕͝Z̵̳͖̗̩͑̇̅͆͒̃̈́̒̅͊̅̉͒́̓͆̚͠͠Ž̶̧̜̩͉̼̻͍͖̲̗̫̮̳͎͉̥͍̙̖̤̞͚͉̣̠͍͒̑͂̆̓̾͋̓̀́͂͋̑̌̅̑̈́̎͆͂͋̏͘͠͝͠ͅẔ̸̞̆͗̎̏̃͠Z̸̧̧̛̛̤̳̲̼̪͉̻̣͈͕̝̳̜̺͓̯̭͕͍͖̪̑̄͂̐́̒͛̀͒͋̓̿̔̽̄̀́̔̆͂̈́̓͊̍͊̃͌̍͊͌̔͘͝Z̵̛̗̝̣̝͔̋̈́͗͊͗̈́̅̓̐̄̏͜Z̵̨̡̨̛̘͉͇̝̜͈̼̟̣̮͕̝͙̣͇̣͓̠̲̗̙̖̩̥̬̠̮͚͚̱̺̭̬̝͚͕̤̥̤͔̻̉̊͆͋̆͑̉̅̌͆̋̌͗̆̀̊̋̆͋̒̀͊̐̓̑́̋̋̈͂̕͜͝͠ͅŻ̸̢̨̧̡̪͈̺̖̖̭̬̻̬̥͈͇̞̫̠̰͕͕̳̠̻̼̘͎̝̪̙̥͈̠̳͈̆͜Z̸̧̨̨̛͈̞̭̮̪͔̩̲̻͕̮̦͕̺͓͍̑͑̈́̉̾͒̃́̀̆͂̅̇̄̿̀̐̅̿͊͒͂̈̋̀̐͆̍̇̈́̒͌̏͐̄̀̅̎̂͊͘͠͝͠͝͝͠Z̶̡̲̜͎̜̟̠̥̙̦͂̾̌̀̌̓̄̍̎̽̆̆͊̌̀́́̅̉̐̑̌́͋̋̚̕̕͜͜͝Z̸̡̨̧̧̛̲̘̥̻̩̭͖͔̱̦̙̖̞͈̟̳͍͔̦̬̲̠̭̼͈̱̜̘̥͓̞͕͓̳̗̥̝̥͈͎̲̳̪͑̋̽͊̒̎͐̋̾̿͛̊́̽̕̚Ż̴̛̺̹͕̪̟̠̀̊̂͒͂̊́͆̄́́͐̀̈́̀̐̌̆͊̈́̊̑͑̓̒͑̾̍̄͆͂̈́̒͑͌̽͋͘̚̚͠Z̵̡̧̛͚͇͖͖͈͕͈̮͖̯̟̞͍̞͇̜̠͇͚̼̪̹̫̻̙̘̺͖͔͆̇͌̊̉͆͛̈́̀̓͗̉̿̾̃̒̇̉̉̀̈̅͋͒̎̀̕͠͝Z̴̢̧̨̢͔̬̪̭͓̟̝̘̺̟̣͇̭͖͓̘͇̜͓̙͖̦͓͙̜̰̯̳̜̱̜̩͓̜͔̫͇͒̉̒̐͊͒͆̄͗̀̇̈́̂͊͒̈̆͌͘͘͜͠Z̵̢̀̋̓́̂̿̃͒̈̀̉̀͆̿̓̐̉͗͗̌̍̈́̀̈͂̀̌̉̽̾́̀̌̑͆͐̀͒́̕̕̕̕͝͝͠Z̷̧̛̳̙̱̳̜̲̦̞̼̣͍̫̬̬̬̳̘͇͈̜͉̤̣̝̘͙̘̥̭̝͍͈̫̠̬͎͓̮͎͕̺͖̀͗͂̅̓̐̾͆̈́̅̅̂̓̐̽̓͐̓̑̍̆͆̀͛̒́̏̐͂͘̕͘̕̚̕͜͝͠Z̴̨̧̜̘͉̜͚͎̳͍̱̪̲͙͇̙̲̽̃̀̾̿̉̃̋͠͝Z̷̡̛̪̤̩̜̰̠͚̭̯̠̮͊͋̆͛̓̈́͑̏̇͂̂̈́͘̕͜Ź̴̙̳͉̺̙̰̲̳̗͓͎̤̟̙͖̳͕͖̖͓̫̹̪̠̠͚̤̜̩͔̼̱͎̭̻̪͊̑͒͒̍̂͌͐̀̐̓͜͠Z̴̧̨̡̰̻̗̬̩̯͇̜̳̹͖̜͚̩̫̜̭͈͍̹̫̥̮͇̤̳̰͕̗̣͉̟̗̞͖̻̦͍͊̈́̿͑͑̊̿͊́̓͘̕͜Z̴̨̛̩͈̩̮̯͉̜̳̥̗̜̼̭̤̞̩̹̙͍͚͙̪͖̹̳̝̹͆͒̔̔̑̊̓̓͑̿͊̍͆͋͆̉̍̄̓̆̓͒͑͛̎̒̈́̑̎̾͘͝͠Z̵̨̡̧̤͕͔̤̯̯̝̺̲͉̰̮̟̥̰̬̹̬̱͇̊̀͆͋͋͊̉́̈́̃̎͒̌̅̆̾̐̃̐̎̅̑̆̊̓̀͊́̐͗́̉̎̍̾̽̚͝͝͠͝͝Z̸̡̛̛̮̰̦͕͚̗͈̱͈̯͉̀̈̊̿̀͂͒͒͒ͅZ̸̨̨̧̧̡͈͙̮̰͖̣̘̩̜̻͔̻͉̰͙͓̖̖͎̺̦̤̖̩̫̲̬̫̭̼̝̪͉̯̞̱̜͈̻̑̈́̂̑̉͊̊͘Z̶̨̡̧̡̢̧̲̖̰̫̹͕͚̳̺̙͍̟̝͚̱̖̗̳̳͉̄̽̓̿̌̂̅͛̓̽͐̎͆̔̐Z̵̨̢̢̢̧̧̢̛̛̛̺͖͚̗̖͈̺̮̬̥͖͕͖͕̦̭̻̱̯̘̣̞͚̜̼̭̪̮̮̰̠͇̲͔̘̪͈̥̦͉͊̇̌̎̽͐͗̓͆̇͑̈́̑͋̽̀̎̅̈́̋̑̀̍̏͗́̓͘̚͘͘̕͝ͅ
        ̵̧̧͉̟̲̪̞̼̯̤̤͓̦̫̬̪͉̪̅̏̂̔̊̉̂̓̉͂̀̒̒͗̓̕͠͝ͅͅẒ̴̢̨̛̣̼͍̭͔̠̭̖̜̜͎͖̱̗̺̝͍͙̭̹̭̳̣̪̦̝̠̼͔̝͎͎̟̲͚̺͋̽̍͑͗͐͒̈̉̉̑̑̍͋̀́̾̋̎̇͊̌̚̕͠Z̶̢̧̧̨̧̧̳̩̩͉͎̪̫͓̳̟̣͍̬̖̘̜̜̻̻̟̞̗͈͖͎̰̱̭͉̜̥̾̑̾̆̔̊́̄́͝ͅZ̷̡̨̡̨̧̫̫̱͓̯̬̫̳̳̫̰͖̗͚̖̤̫̘͖͇̹̟̬͚͉̹̪̖̝͓͈̩̫̻͕͎͕̥̼͉̫̎͜͜Z̷̡̨̢̡̧̛̫̼̲͚̣̠̭̦̼̠̦͍̞̟͎̻͔͐̔͑́̎͊̆̑̾̈̐͒̋͆̄̑͑̾͑͂͆̀̓͛̈́́̾̂̉̓͑́̅͘͝Ż̶̲̞̤̖͓͂͘Z̸̧̡̘̰͔̘̰͇̯̫̮͕̪̺̟̩̳̰̭̤̯̠̫̘̹̗̩͔̬̈́͛̈͒̐́̎͆̽̅̒̋̄̾̓̾͐̑̈́̄͂͂̈́͛̊͊̾̊͊͜͝Z̵̛̖̖̭͉͖͚̬̼̫̺͉̭̮͎̙̦͈͍̜̳͍̯̟̺̽͊́͆͗̃̈́̓͐́́̌̔́̇̾̀̈́̈̇̓͋̽̑̇̈́̏̈́͜ͅZ̸̢̢̧̢̛̛͇͎̩̙̲̠͔̘̙̖͎̗̗͖̫̫̮̭̫͎͙̫͇̠͈̖̩̥̼͍͓̻̟̗̜̦̳̺̃̈́̀͂̆̈̓͑̉͛͋̅͗͒̓͋̈̀̑̔̐̊̀̓͛̿͆̓̾͛̾̓̌͋͂̅̐͜͠Z̸̧̳̱̩̗̤̗̠͇̯̙̰͚̄͛̅͊́̽̑̈́͛͗̄͂̔͋̾̀͊̎̔̔̐̚͜͠Z̶̧̡̡̢̧̢̧̛̟͕͉̻̭̟̟̦̭̙͓̩̲͔̯̝̱̝̥̬̹̘̼͙͉̥̰͙̩͙̰̮̞̟̼͚͉̀͐̆͋̕Z̵̧̨̨̡̺̠̟̪͔̭̺̪̻̙̰̮̖̮̙̘͇͎̳͈͉̰͉͔̹̪͔̭͕̙͓̠͔͇̅̑̓̇̄̿͊̂̉̄͊̈̿̈́̇͐̇̒̚͜͝͠ͅZ̸̞̪̑̾̓̏͒̐͊̋̏̓͜Z̸̨̡̨̛̮̖͎͕̥͉̜̗͚̬̫̤̬͎͓͔̗̳̭̣͈̞̜̘͕͙̺̣̭̻̼͍̮̓̉̂̽̓̇̋̋̓̽́͌́̓́̃͐͂̈́͛͐̈́̃͂̃͗̀́͒̐͑͆̚͘͜͝͝͝Z̸̡̡̤͕̥̖͕̯̱̟͙̱̗̮̭̻̹̻̺̤̰͇̳̦͇̉̇́̅̒̔̄̂̀͊͌̇͌̓͒̔̆̽̀͐̆̐̓̓͗͊̍͋̈́́͘͘͜͜͝͝͝Z̴̛̛͔̺̥̤̯̖̱̦̙͂̈͝Z̷̙̗̬͚͉͉̞̗͒̓͌̿̈̏́͆̔̊̄̊͆̒̍̇̄̐̈́̾͗͑̑̐͐̐͑̐͐͛̓̿̄͘̚̚̕͝͝Z̶̢̡̲̬̥̦̳̝͕̰̜̼̮̹̩͓̗͎͎͖͎̟̈́̅̾͋̏́̔̆̈́̒͛͊͐̉͑̑̈̄̄͊̎͗̐̅̕͘̕͝͝Z̸̨̢̛̖̖̘̑̓͌̔̾̆͗́͌̊̆́̒̈́̾̈͐̑̓͘̕͝Z̷̧̢̧̛͕̣̫̤̣̻̪͖͇̩͓̹̬͇̺͎̘͈̮̪͔̫̰̰̮̠͚̪̞̜̮̱̺̺͉͍͑͆̈́͑̽̄͗̍͑̔͘̕Z̵͙̺̽͌̍̋͊̈̋̈͑͊͊̕̕̕Z̸̛̛̠̳̰͔͈̈́̅̓̌͊̔̍̅̎̄͋͛͑͆͊̽͐̀̍̈́͒́̂́̓͛͆̐̚͘͝͝͝Z̷̧̨̡̡̡̛͚̣̰̮͔͔̘̦̱̟̝̦͖͉̼͇͉̟͚̬̺̹̤͕̬̱̳̟̘̞̙̞̽̐̑̓̈́͌̉͒̄́̌̂͊͑̆̆̉̉̓͂́̎̓̅͑̋͐͊̋͂̕̚̕͜͝͠͝Z̸͔̟̝̱̫̦͌̈́̊̍̉̒̎̎͋͆͝Z̵̢̧̢̨̪̘͖̥̪̜͚͍̝͕̥̟̮̥͔̘̜̹̠̝̺̪̤̫̪̝̰̣͙̺̙̥͓̱̲͓̤̑̈́͋̓̔̀͌̈́̏̀͑̍͌͆̇̍̓̇̊͊̐͋̈̈́͋͐̄͆́̐͋̿͌̚͘̕͝͠ͅZ̴̡̻̥͕̳͚̬̫̙̝̣̯̀̒̅̿̈́̓͋̎̊̿̽̀͂̂̀̃̏̾̋͆͌̌͗̀̇̂͋̂͘̕͝͠͠͝͝͝͝Z̵͙̜̪̩͖̹̖͙̟̗͖̣̐̈́̋̿̈́͒̈̿̋̈́̂̓̊̀̾́̊͋̐͂̃͒́̔̇̌̋̌̄̍͐͑̏́̓͘͘̕̕̕̚̕͘͜͠Z̴̡̡̹̳̩̤̭̰͍̗̞͍̭̫̭͔̱͚̝͉̰̙͎̮̫̳̻͕̗͐̑̔͜͜͝ͅZ̵̛̐́̆̒͋͂̄̓́́̈́́͂͌̽͌̉̾̚̚͘̕͘͝͠͝͝ͅZ̸̢̢̡̡̢̧̡̛̩̠̮̤͇͚̝̭̟̖̯͙͍͓͕̭̘͚̝̗̠̹̼̱̰͇͕̲̭͖̥͚̝͇̹̻̙͇̝͂̄͐̈́̍̓̐̾̆͌̉̐͂́͛̐̔̅͐̾̓͗̐̉̓̓̆́̓͂̔̌̿̽͂̌̏̉̌͘̕͘̚̚̕͜͝͝͠ͅZ̸͉̮̭̗̣̪͉͔̰̤̠̱̝̪͙̹̗͚̭͚͉̬̀̐̋̉̊̒̿́͒̅̍̾̍̍͂̄͋̀͗̃̀͆̍̊́̾̀̓́̋͋̈́̌͊̅͆͌̈́̀̕͘̚͜͝͠͠Z̸̧̨̡̻̖͈̣̝͖͈̘̮̹̲̖̮̮̗͂̄̍͆͘͠ͅZ̵̡̨̜̹̦̹̾͜͜Z̷̧̢̢̬͕̰͕͔̻͓͔̹̬̥̲̙͕̲̼͕̤̝̯͓̤͇͉͚̟̳̞̺͎̮̬̤͖̤̖̬̞̙̘͇̹̄͑ͅZ̷̨̼̝͓͔̖̘̘͎͆͆͛͛́͊͒͛͗́͘͠͝Z̴̢̼͙̖̦̹̦̫̙͇̖̖͇̩̥̦̫̪͐̿̈́̽́̄͗̊̔̂̈́̐̉̂̈͒̃̈́͛͛͊̿̌̊̍̄̕̚͘͠͠͠Z̷̬̠̹̠̬̙̹͈͙̻͍̺͂͊͒͗̾̐͊́̑͐̋́̂̑̋͋̃́͗̈́̀͘̕͘̚̚͝
        ̷̡̡̢̡̢̧̧̨̬̮̩͉̳̳̯͔͇̱̼̤̲̞̠̭̞̖̰͔̱͉̦̝͔̞̞͈̞͔̪͈̹̖̲͎̟͆͋̿́̐͗͑̔̾̂̂̔͋̂͛͐̊̍̏̑͌̂͂͆́̎̾̆̍̓̿͑̅̏̈́̈́̕͜͝ͅͅZ̷̢̢͇̗͉͚̪̤̩̘̦̻͉͎̳͑̇́̈́̎̓͋̒̆̒̆̆̄̓̐̀̔͛͌̎̃̾̎̈͊̀̓̚͝͝ͅZ̴̛͔̦̈́̄͗͆͌̀͐̎͋͌͛̄̿̾͒́̓̿̍͗̀̔̅͊̀̊̇̔͂̌͋̔̉̽͐͑̄̐̀͗̚͘̚̚̚͝͠Z̵̛̛̻͎̩̰̩͈͔̻̳̞̥͓̔̏̉̿͂̑̾̂͑͒̆̓̃̈́̇̀̎̉́̈́̇͆̊͛̊̋̐̔͆͛̈̓͊͑̆̒͑͌̈́̀̚͘̚͠͠͝Z̷̢̨̧̡̡̡͉̩̩̤̗̤̺̬͔͕͙̦̬̗̪̯̟͕͇̰͇͍͇̖̳͓͉̮̩͚̰̗̩̮͊̆̊͑̓̋̀̊͋͌̿̍̕͘͘͠͝͝ͅͅͅͅͅZ̷̢̢̧̨̝̱̙̹̞̗̰̬̣̬̫̜͚͇̯͈̱̦͇̙̦̱͍̹̯̱̻͕͙̰̺̝͚̖̬̟̦̠̲̜̅̿̽̓́̈́̍̽͗̈̃̓̄̉͂̈́̑͂́͐͒͐̄̿̋͊̀̽͂͘ͅͅZ̴̨̛̬̜̖̞͖̝̖̩̥̭̦̤̺̭͇̯̺̻̩̹̩̟̻͎̥̈́͜͜͝Z̷̨̨̡̨̧̧̡̛̖̟͓͍̬̬̦̬͈̭̦̳̰̝̩̠̹͓͚̦̖̩͙̯̫̖̫̬͎̘͕͌͊͊̓̽̓̉̑̾̾̑͂̒̚͠͠ͅͅZ̴̢͈̤̥̫̥͉̦͕͔̐̀͜Z̴̧̡̠͚̤͓͓̪̲̬͙̝͍̙͚͖̝̱̎̈́̀̎̑̊̑͒̽̌̓̋͑̋͌̈́̓̋͛̌͗̎̒̋̊͐̓̎̎̅͊̐͒̐̋̓̾̀̈́͛͐̽̓̚̚͘͝Ź̴̛̼͓̱̑̀̀̀͌̏̅Z̶̧̢̨̛̛̥͔̲̯̥͓͖̺͇̝̺͇̼̬̪̞̩̠̙͍͚͓̞̠̦̼̭͚̠̳̣̗̝̹̅̈̉̎͗̈̔̂̌̉̓͋̆̌̌̀͘͘͜͝ͅZ̴̛̟̦̪͈̮̳͚̗̘͒͐̏͂͐͋̓̉͊̀̉͊́̿̃͌̽̏̉̓̏̋̀̎͒̋̀̈́͛͘͘̕͝Z̸̡̢̢̨̙̲̘͉͖̞̖̟̭̻͕͉̞͔͈̦̰͇̦̭͖͕͛̀̈͂̔́̇͛̾̋͑̆̔͋̓̓̅͒̋̓̀̌̄̆̽̕̕̚͜͝ͅZ̴̡̡̡̢̧̢̤̞̜̲̱̳̗͓͎͈̼̭͙͉̯͐̋͜͝Z̶̛̛͈̗͖͙̗̹͍͉͉̯̩̪͔͚̮̱̦͕̈́̀̐́̕Z̵̧̬̙̺̣̟͓̠̭̞̲͚̫̱̦̹̪̱͇͍̤̙̫͔͕̜̼͍̳͔̳̤͍̪̃͛̈́́͒͂̔͆̿̽̈͂̂̿̊̏͊̓̐̈́̈̌͑̐̿͐̂̀̅͐͌̆͂̓͐̽́̀͑͐̓͘̚̚̚̚͜͝͠ͅZ̸̧̛͚̜͍̘̜̭̼̩̰̝͎͍̫͚͇͓͔͍̦̫̫͙̪͉̩͙̯̝̤̤̒̐̄̓̇͂̏͗͛́͋̌Z̵̡̢̠͕̦͇͖̯͍̫͓̽͐̅͂̉̀̋̾̓͑̑̐̾̓̄̇̓͊̈͛̐͊̈́͊͐́̈́̍̃̄̇͊̇̅̄͗̓̈́͊̈́́́̍̚̚̕͘͜͜͝͠ͅZ̴̨̨̪͍̱͎̱̳̱̘̬͚͓͌̅̆͆̈́̃̂̈́̿̎̏̽̃̿̏̃̅́͆̈̌̏̿͛̌͛̂́̀͒̀̀̕̚̕͝͠͝͝Z̴̢̛̭͔̖̪̘̘̓̀́̄́̂́̍͌̾̐̇̀̇̌̂̀̊͛͒́̽̀̕̕͠͝͝͠Z̸̢̢̢̨̧̺̻̩̯͍͉͓͉̦̜͚͍͉̪̗̠̺̬̜͇̯̖͎̙̰̬̱͎̹̙̙̹͙͓̞̪͍͓͖͚̀͜͜Z̸̧̠͇͎̭̻͙̙͎͈͖͔͚̼͙̦͇͎̥̫̠̳̜̳̬̓͛̏͂̈́͒̑̑̋͊͗́͛͋͒̉̅̈́͛͛̋̃̅́͑̓̎͂͂͑̃̀̋͑͐͆̀̃̍̕͝͝ͅZ̵̧̬̼̗̜͓͕̩͌̌̏̂̽̓̋̀͠͝ͅͅZ̶̢͇͈̮̝̯͎̩̱̾̓̈́͜Z̷̨͔̘̬̘̣͕̳̭͉͇͗̌͑̔̆̔͊̏̀̇̿̃̄̈́̃̏̈̓͊̊͠͝͠Z̸̛̺̯̭͋́́̿͘̚Z̶͉͙̪̲͎͈̤̭̣̟̱̣̪̖͉͔̞͍̻̳͖̙͉̠͎̩͚̼̳̩̖̙̩̖̱̖̳̺̃̈́͆̋̍̑͊́͂̍̄̅̉̿̐͊͗̎̈́̇͗̃͗̒̏͆̊̏͑̈́̐̔͋̊̋̈́̐̔͗͑̆̔̈̚̕͠͝͠͠ͅZ̵̢̧̧̡̢̨̡̪̪̹̣͙̣̼̟̜̖̳͙̹̙̝̼̬̗̳̬̙̖͖̪͈̭͙̞̜̳͙͖̾͐̊̃́͆̉̋̏̈́̑̈̀̈͊͛͂͗̓́̆̈͆̍̈́͗̊̀̆̔̒̚̕͝͝͝Ž̸̛̙̰̈́̓̓̽̿̓́̔͂̆͝͝͝Ž̷̢̲̩́̓̐͋̈́̉ͅZ̸̛̛̮͎̞͚̙͍̝̠̲̱̅͊́͑̂̾̃̍͂̌͑̓̓͛͗̉̏́͋̉̂́̄̀̄̽̉̔̈́̐̌̚̚̕͝͝͝͝ͅZ̶̢̡̡̛͉̺̪͚̞̣͚̺̖̜̣̦̠̱̪̝͕̙̯͚̙͚͓̮̹͙̬͇͈̝̻̪̣̈́̔̉̏̅́́̀͋͂̎̀́̅̐͑͛́̀͆̐̄͐̊̍̂͂̓̈́̚̕͘͜͠͠Z̶̡̢̢̛͚̙̟̳̯͓̣̞̭̩̞̘̙̦͇̦̼͎̗̞̬̥̩̭̦̳͍̫̱̼̳̬̗͙̳̏̽ͅZ̴̨̧̧̧̛̩̱͕͕̯͈̙̙̯̞̩̤͎̺̪͓͙̺̣̞͍̬͙̗̣̲̭̣̤̫̱͕̟͊̀̈́̈̇͂̂̒̈́͒̓̀͐͛͛͛̀͊̀̉̄͛̉̋͊̒̿͌̌̚͝͝ͅͅZ̸̧̡̨̧̨͕̯͎̪̹̤̜̘̱̪̯͙̼͖̬̟̦͎͚͉̫̼̩̥͈̼̼̭͕͍̭̮͔̣̞͚͓̦͌̔̀̑̎̾̃̇͒̒̒̂̓̂͋́͑̌̋̃̉̑̔͗̓̓͒͊̓̉̌͛͒̀̈́̿͠͝ͅZ̴̙̣̗͇͇̱͍͙̲̤͈̝̱̘̯͈̞̼̀̽̍͂͋̈́͆͂̒́̍̃̆̒͋̎̈́͑̄͐̈͗͌͒͜͝Z̵̢͓͕̤̜̳͎̝͇̰̝͇̥͔̗͎̭̺̻̗͈̦̥͇̫̣̎́͂̀͒̈͋͛̈́̂͒̈́̐̃͑́̓̓̀́̈́͊̓͂̎͆̊͌̓̈̾͋̂̃̾͊͘̚̕̕̕̚̕̕͜͝͠͝""",
        'buttons': [
            {
                'label': 'GitHub',
                'url': 'https://youtu.be/06t4AUshIg4?si=7S5Gfw_XQbxMZ3nh',
            }
        ],
    }

    try:
        RPC.connect()
        logger.info('Running...')

        if loop:
            activity_types = [ActivityType.COMPETING, ActivityType.WATCHING]
            images = ['kissingboykissers_512x512_png', 'astolfo_512x512']
            while True:
                for activity_type, image in zip(activity_types, images):
                    RPC.update(
                        **base_params, activity_type=activity_type, large_image=image
                    )
                    time.sleep(5)
        else:
            RPC.update(**base_params, activity_type=ActivityType.COMPETING)

    except Exception as e:
        logger.error(f'Exception: {e}')
    finally:
        RPC.close()
        logger.error('Connection closed.')


if __name__ == '__main__':
    main(loop=True)
